#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-ipatente-rg-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
    }

  # module.key_vault.azurerm_key_vault_access_policy.apim will be created
  + resource "azurerm_key_vault_access_policy" "apim" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = (known after apply)
      + object_id               = "5622ec45-ad97-46ae-b2c0-035ad01f70b2"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_cd will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_infra_cd" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Purge",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "13becd8f-c214-40ed-8e78-eff499bbd94c"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_ci will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_infra_ci" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "6dd98eea-3184-4d72-9296-f47248122a2d"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.module.key_vault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = false
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-ipatente-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-ipatente-rg-01"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.module.key_vault.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-ipatente-kv-lock"
      + notes      = "this items can't be deleted in this subscription!"
      + scope      = (known after apply)
    }

  # module.vehicles_app_service.module.vehicles.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "production"
          + "AUTH_SECRET"                                     = "TODO: GET FROM KV"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "TODO:"
          + "EXT_API_MOCKING"                                 = "false"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "TODO: GET FROM KV"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "TODO: TO BE SET AFTER APP GATEWAY AND NS CONFIG"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "false"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "false"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "TODO: "
          + "OIDC_CLIENT_REDIRECT_URI"                        = "TODO: "
          + "OIDC_CLIENT_SECRET"                              = "TODO: "
          + "OIDC_ISSUER_URL"                                 = "TODO: "
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "TODO: GET FROM KV"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "TODO: GET FROM KV"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-svc-vehicles-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-ipatente-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APP_ENV",
            ]
        }
    }

  # module.vehicles_app_service.module.vehicles.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "staging"
          + "AUTH_SECRET"                                     = "TODO: GET FROM KV"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "TODO:"
          + "EXT_API_MOCKING"                                 = "false"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "TODO: GET FROM KV"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "TODO: GET FROM KV"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "TODO: TO BE SET AFTER APP GATEWAY AND NS CONFIG"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "false"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "false"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "TODO: "
          + "OIDC_CLIENT_REDIRECT_URI"                        = "TODO: "
          + "OIDC_CLIENT_SECRET"                              = "TODO: "
          + "OIDC_ISSUER_URL"                                 = "TODO: "
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "TODO: GET FROM KV"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "TODO: GET FROM KV"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.vehicles_app_service.module.vehicles.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-vehicles-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-vehicles-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.vehicles_app_service.module.vehicles.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-vehicles-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-vehicles-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.vehicles_app_service.module.vehicles.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-svc-vehicles-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-ipatente-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.vehicles_app_service.module.vehicles.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.20.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-svc-vehicles-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.key_vault.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/key_vault.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

Error: No group found matching specified filter (displayName eq 'io-p-adgroup-admin')

  with module.key_vault.data.azuread_group.adgroup_admin,
  on ../_modules/key_vault/data.tf line 4, in data "azuread_group" "adgroup_admin":
   4:   display_name = "${var.prefix}-${var.env_short}-adgroup-admin"

GroupsClient.BaseClient.Get(): unexpected status 403 with OData error:
Authorization_RequestDenied: Insufficient privileges to complete the
operation.

Error: No group found matching specified filter (displayName eq 'io-p-adgroup-services-cms')

  with module.key_vault.data.azuread_group.adgroup_services_cms,
  on ../_modules/key_vault/data.tf line 9, in data "azuread_group" "adgroup_services_cms":
   9:   display_name = "${var.prefix}-${var.env_short}-adgroup-services-cms"

GroupsClient.BaseClient.Get(): unexpected status 403 with OData error:
Authorization_RequestDenied: Insufficient privileges to complete the
operation.

Error: No group found matching specified filter (displayName eq 'io-p-directory-readers')

  with module.key_vault.data.azuread_group.github_action_iac,
  on ../_modules/key_vault/data.tf line 13, in data "azuread_group" "github_action_iac":
  13:   display_name = "${var.prefix}-${var.env_short}-directory-readers"

GroupsClient.BaseClient.Get(): unexpected status 403 with OData error:
Authorization_RequestDenied: Insufficient privileges to complete the
operation.
::error::Terraform exited with code 1.
```

</details>
